FuYunLi/SZP_BSP/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# LVGL 经典 Demo 启用
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_USE_DEMO_STRESS=y

# LVGL 内存优化：使用标准C库malloc，自动从PSRAM分配
# 解决摄像头DMA缓冲区分配失败问题（释放64KB内部SRAM）
CONFIG_LV_USE_CLIB_MALLOC=y

# 蓝牙与 NimBLE 协议栈启用
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# 音频与系统内存优化：将 Wi-Fi 和 NimBLE 蓝牙内存池路由至外部 PSRAM
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=n
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# 摄像头DMA内存优化：增加保留的内部DMA内存池
# 摄像头RGB565格式需要~30KB连续DMA缓冲区
# 测试结果：128KB配置后最大空闲块19KB，仍不足30KB
# 已占用DMA缓冲区：LCD(12.5KB) + LVGL(6.25KB) + I2S(8-16KB) + 其他 = ~100KB+
# 总需求：已占用 + 摄像头 = ~130KB+，需要更大的保留池
# 将保留内存池增加到256KB，确保摄像头DMA缓冲区可成功分配
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
